name: "ResNet-56"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 32
    mean_file: "examples/cifar10/mean.binaryproto"
  }
  data_param {
    source: "examples/cifar10/cifar10_train_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 32
    mean_file: "examples/cifar10/mean.binaryproto"
  }
  data_param {
    source: "examples/cifar10/cifar10_test_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_conv1"  
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "res_1_branch1"
  type: "Convolution"
  bottom: "conv1"
  top: "res_1_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_1_branch1"
  type: "BatchNorm"
  bottom: "res_1_branch1"
  top: "res_1_branch1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_1_branch1"  
  type: "Scale"
  bottom: "res_1_branch1"
  top: "res_1_branch1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_1_1_1"
  type: "Convolution"
  bottom: "conv1"
  top: "res_stage_1_1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_1_1"
  type: "BatchNorm"
  bottom: "res_stage_1_1_1"
  top: "res_stage_1_1_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_1_1"  
  type: "Scale"
  bottom: "res_stage_1_1_1"
  top: "res_stage_1_1_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_1_1_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_1_1"
  top: "res_stage_1_1_1"
}
layer {
  name: "res_stage_1_1_2"
  type: "Convolution"
  bottom: "res_stage_1_1_1"
  top: "res_stage_1_1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_1_2"
  type: "BatchNorm"
  bottom: "res_stage_1_1_2"
  top: "res_stage_1_1_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_1_2"  
  type: "Scale"
  bottom: "res_stage_1_1_2"
  top: "res_stage_1_1_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_1_1"
  type: "Eltwise"
  bottom: "res_1_branch1"
  bottom: "res_stage_1_1_2"
  top: "res_1_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_1_relu"
  type: "ReLU"
  bottom: "res_1_1"
  top: "res_1_1"
}
layer {
  name: "res_stage_1_2_1"
  type: "Convolution"
  bottom: "res_1_1"
  top: "res_stage_1_2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_2_1"
  type: "BatchNorm"
  bottom: "res_stage_1_2_1"
  top: "res_stage_1_2_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_2_1"  
  type: "Scale"
  bottom: "res_stage_1_2_1"
  top: "res_stage_1_2_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_1_2_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_2_1"
  top: "res_stage_1_2_1"
}
layer {
  name: "res_stage_1_2_2"
  type: "Convolution"
  bottom: "res_stage_1_2_1"
  top: "res_stage_1_2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_2_2"
  type: "BatchNorm"
  bottom: "res_stage_1_2_2"
  top: "res_stage_1_2_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_2_2"  
  type: "Scale"
  bottom: "res_stage_1_2_2"
  top: "res_stage_1_2_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_1_2"
  type: "Eltwise"
  bottom: "res_1_1"
  bottom: "res_stage_1_2_2"
  top: "res_1_2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_2_relu"
  type: "ReLU"
  bottom: "res_1_2"
  top: "res_1_2"
}
layer {
  name: "res_stage_1_3_1"
  type: "Convolution"
  bottom: "res_1_2"
  top: "res_stage_1_3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_3_1"
  type: "BatchNorm"
  bottom: "res_stage_1_3_1"
  top: "res_stage_1_3_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_3_1"  
  type: "Scale"
  bottom: "res_stage_1_3_1"
  top: "res_stage_1_3_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_1_3_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_3_1"
  top: "res_stage_1_3_1"
}
layer {
  name: "res_stage_1_3_2"
  type: "Convolution"
  bottom: "res_stage_1_3_1"
  top: "res_stage_1_3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_3_2"
  type: "BatchNorm"
  bottom: "res_stage_1_3_2"
  top: "res_stage_1_3_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_3_2"  
  type: "Scale"
  bottom: "res_stage_1_3_2"
  top: "res_stage_1_3_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_1_3"
  type: "Eltwise"
  bottom: "res_1_2"
  bottom: "res_stage_1_3_2"
  top: "res_1_3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_3_relu"
  type: "ReLU"
  bottom: "res_1_3"
  top: "res_1_3"
}
layer {
  name: "res_stage_1_4_1"
  type: "Convolution"
  bottom: "res_1_3"
  top: "res_stage_1_4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_4_1"
  type: "BatchNorm"
  bottom: "res_stage_1_4_1"
  top: "res_stage_1_4_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_4_1"  
  type: "Scale"
  bottom: "res_stage_1_4_1"
  top: "res_stage_1_4_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_1_4_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_4_1"
  top: "res_stage_1_4_1"
}
layer {
  name: "res_stage_1_4_2"
  type: "Convolution"
  bottom: "res_stage_1_4_1"
  top: "res_stage_1_4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_4_2"
  type: "BatchNorm"
  bottom: "res_stage_1_4_2"
  top: "res_stage_1_4_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_4_2"  
  type: "Scale"
  bottom: "res_stage_1_4_2"
  top: "res_stage_1_4_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_1_4"
  type: "Eltwise"
  bottom: "res_1_3"
  bottom: "res_stage_1_4_2"
  top: "res_1_4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_4_relu"
  type: "ReLU"
  bottom: "res_1_4"
  top: "res_1_4"
}
layer {
  name: "res_stage_1_5_1"
  type: "Convolution"
  bottom: "res_1_4"
  top: "res_stage_1_5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_5_1"
  type: "BatchNorm"
  bottom: "res_stage_1_5_1"
  top: "res_stage_1_5_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_5_1"  
  type: "Scale"
  bottom: "res_stage_1_5_1"
  top: "res_stage_1_5_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_1_5_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_5_1"
  top: "res_stage_1_5_1"
}
layer {
  name: "res_stage_1_5_2"
  type: "Convolution"
  bottom: "res_stage_1_5_1"
  top: "res_stage_1_5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_5_2"
  type: "BatchNorm"
  bottom: "res_stage_1_5_2"
  top: "res_stage_1_5_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_5_2"  
  type: "Scale"
  bottom: "res_stage_1_5_2"
  top: "res_stage_1_5_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_1_5"
  type: "Eltwise"
  bottom: "res_1_4"
  bottom: "res_stage_1_5_2"
  top: "res_1_5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_5_relu"
  type: "ReLU"
  bottom: "res_1_5"
  top: "res_1_5"
}
layer {
  name: "res_stage_1_6_1"
  type: "Convolution"
  bottom: "res_1_5"
  top: "res_stage_1_6_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_6_1"
  type: "BatchNorm"
  bottom: "res_stage_1_6_1"
  top: "res_stage_1_6_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_6_1"  
  type: "Scale"
  bottom: "res_stage_1_6_1"
  top: "res_stage_1_6_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_1_6_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_6_1"
  top: "res_stage_1_6_1"
}
layer {
  name: "res_stage_1_6_2"
  type: "Convolution"
  bottom: "res_stage_1_6_1"
  top: "res_stage_1_6_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_6_2"
  type: "BatchNorm"
  bottom: "res_stage_1_6_2"
  top: "res_stage_1_6_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_6_2"  
  type: "Scale"
  bottom: "res_stage_1_6_2"
  top: "res_stage_1_6_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_1_6"
  type: "Eltwise"
  bottom: "res_1_5"
  bottom: "res_stage_1_6_2"
  top: "res_1_6"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_6_relu"
  type: "ReLU"
  bottom: "res_1_6"
  top: "res_1_6"
}
layer {
  name: "res_stage_1_7_1"
  type: "Convolution"
  bottom: "res_1_6"
  top: "res_stage_1_7_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_7_1"
  type: "BatchNorm"
  bottom: "res_stage_1_7_1"
  top: "res_stage_1_7_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_7_1"  
  type: "Scale"
  bottom: "res_stage_1_7_1"
  top: "res_stage_1_7_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_1_7_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_7_1"
  top: "res_stage_1_7_1"
}
layer {
  name: "res_stage_1_7_2"
  type: "Convolution"
  bottom: "res_stage_1_7_1"
  top: "res_stage_1_7_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_7_2"
  type: "BatchNorm"
  bottom: "res_stage_1_7_2"
  top: "res_stage_1_7_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_7_2"  
  type: "Scale"
  bottom: "res_stage_1_7_2"
  top: "res_stage_1_7_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_1_7"
  type: "Eltwise"
  bottom: "res_1_6"
  bottom: "res_stage_1_7_2"
  top: "res_1_7"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_7_relu"
  type: "ReLU"
  bottom: "res_1_7"
  top: "res_1_7"
}
layer {
  name: "res_stage_1_8_1"
  type: "Convolution"
  bottom: "res_1_7"
  top: "res_stage_1_8_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_8_1"
  type: "BatchNorm"
  bottom: "res_stage_1_8_1"
  top: "res_stage_1_8_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_8_1"  
  type: "Scale"
  bottom: "res_stage_1_8_1"
  top: "res_stage_1_8_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_1_8_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_8_1"
  top: "res_stage_1_8_1"
}
layer {
  name: "res_stage_1_8_2"
  type: "Convolution"
  bottom: "res_stage_1_8_1"
  top: "res_stage_1_8_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_8_2"
  type: "BatchNorm"
  bottom: "res_stage_1_8_2"
  top: "res_stage_1_8_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_8_2"  
  type: "Scale"
  bottom: "res_stage_1_8_2"
  top: "res_stage_1_8_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_1_8"
  type: "Eltwise"
  bottom: "res_1_7"
  bottom: "res_stage_1_8_2"
  top: "res_1_8"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_8_relu"
  type: "ReLU"
  bottom: "res_1_8"
  top: "res_1_8"
}
layer {
  name: "res_stage_1_9_1"
  type: "Convolution"
  bottom: "res_1_8"
  top: "res_stage_1_9_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_9_1"
  type: "BatchNorm"
  bottom: "res_stage_1_9_1"
  top: "res_stage_1_9_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_9_1"  
  type: "Scale"
  bottom: "res_stage_1_9_1"
  top: "res_stage_1_9_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_1_9_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_9_1"
  top: "res_stage_1_9_1"
}
layer {
  name: "res_stage_1_9_2"
  type: "Convolution"
  bottom: "res_stage_1_9_1"
  top: "res_stage_1_9_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_9_2"
  type: "BatchNorm"
  bottom: "res_stage_1_9_2"
  top: "res_stage_1_9_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_9_2"  
  type: "Scale"
  bottom: "res_stage_1_9_2"
  top: "res_stage_1_9_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_1_9"
  type: "Eltwise"
  bottom: "res_1_8"
  bottom: "res_stage_1_9_2"
  top: "res_1_9"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_9_relu"
  type: "ReLU"
  bottom: "res_1_9"
  top: "res_1_9"
}
layer {
  name: "res_2_branch1"
  type: "Convolution"
  bottom: "res_1_9"
  top: "res_2_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_2_branch1"
  type: "BatchNorm"
  bottom: "res_2_branch1"
  top: "res_2_branch1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_2_branch1"  
  type: "Scale"
  bottom: "res_2_branch1"
  top: "res_2_branch1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_2_1_1"
  type: "Convolution"
  bottom: "res_1_9"
  top: "res_stage_2_1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_1_1"
  type: "BatchNorm"
  bottom: "res_stage_2_1_1"
  top: "res_stage_2_1_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_1_1"  
  type: "Scale"
  bottom: "res_stage_2_1_1"
  top: "res_stage_2_1_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_2_1_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_1_1"
  top: "res_stage_2_1_1"
}
layer {
  name: "res_stage_2_1_2"
  type: "Convolution"
  bottom: "res_stage_2_1_1"
  top: "res_stage_2_1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_1_2"
  type: "BatchNorm"
  bottom: "res_stage_2_1_2"
  top: "res_stage_2_1_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_1_2"  
  type: "Scale"
  bottom: "res_stage_2_1_2"
  top: "res_stage_2_1_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_2_1"
  type: "Eltwise"
  bottom: "res_2_branch1"
  bottom: "res_stage_2_1_2"
  top: "res_2_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_1_relu"
  type: "ReLU"
  bottom: "res_2_1"
  top: "res_2_1"
}
layer {
  name: "res_stage_2_2_1"
  type: "Convolution"
  bottom: "res_2_1"
  top: "res_stage_2_2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_2_1"
  type: "BatchNorm"
  bottom: "res_stage_2_2_1"
  top: "res_stage_2_2_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_2_1"  
  type: "Scale"
  bottom: "res_stage_2_2_1"
  top: "res_stage_2_2_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_2_2_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_2_1"
  top: "res_stage_2_2_1"
}
layer {
  name: "res_stage_2_2_2"
  type: "Convolution"
  bottom: "res_stage_2_2_1"
  top: "res_stage_2_2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_2_2"
  type: "BatchNorm"
  bottom: "res_stage_2_2_2"
  top: "res_stage_2_2_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_2_2"  
  type: "Scale"
  bottom: "res_stage_2_2_2"
  top: "res_stage_2_2_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_2_2"
  type: "Eltwise"
  bottom: "res_2_1"
  bottom: "res_stage_2_2_2"
  top: "res_2_2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_2_relu"
  type: "ReLU"
  bottom: "res_2_2"
  top: "res_2_2"
}
layer {
  name: "res_stage_2_3_1"
  type: "Convolution"
  bottom: "res_2_2"
  top: "res_stage_2_3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_3_1"
  type: "BatchNorm"
  bottom: "res_stage_2_3_1"
  top: "res_stage_2_3_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_3_1"  
  type: "Scale"
  bottom: "res_stage_2_3_1"
  top: "res_stage_2_3_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_2_3_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_3_1"
  top: "res_stage_2_3_1"
}
layer {
  name: "res_stage_2_3_2"
  type: "Convolution"
  bottom: "res_stage_2_3_1"
  top: "res_stage_2_3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_3_2"
  type: "BatchNorm"
  bottom: "res_stage_2_3_2"
  top: "res_stage_2_3_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_3_2"  
  type: "Scale"
  bottom: "res_stage_2_3_2"
  top: "res_stage_2_3_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_2_3"
  type: "Eltwise"
  bottom: "res_2_2"
  bottom: "res_stage_2_3_2"
  top: "res_2_3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_3_relu"
  type: "ReLU"
  bottom: "res_2_3"
  top: "res_2_3"
}
layer {
  name: "res_stage_2_4_1"
  type: "Convolution"
  bottom: "res_2_3"
  top: "res_stage_2_4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_4_1"
  type: "BatchNorm"
  bottom: "res_stage_2_4_1"
  top: "res_stage_2_4_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_4_1"  
  type: "Scale"
  bottom: "res_stage_2_4_1"
  top: "res_stage_2_4_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_2_4_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_4_1"
  top: "res_stage_2_4_1"
}
layer {
  name: "res_stage_2_4_2"
  type: "Convolution"
  bottom: "res_stage_2_4_1"
  top: "res_stage_2_4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_4_2"
  type: "BatchNorm"
  bottom: "res_stage_2_4_2"
  top: "res_stage_2_4_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_4_2"  
  type: "Scale"
  bottom: "res_stage_2_4_2"
  top: "res_stage_2_4_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_2_4"
  type: "Eltwise"
  bottom: "res_2_3"
  bottom: "res_stage_2_4_2"
  top: "res_2_4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_4_relu"
  type: "ReLU"
  bottom: "res_2_4"
  top: "res_2_4"
}
layer {
  name: "res_stage_2_5_1"
  type: "Convolution"
  bottom: "res_2_4"
  top: "res_stage_2_5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_5_1"
  type: "BatchNorm"
  bottom: "res_stage_2_5_1"
  top: "res_stage_2_5_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_5_1"  
  type: "Scale"
  bottom: "res_stage_2_5_1"
  top: "res_stage_2_5_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_2_5_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_5_1"
  top: "res_stage_2_5_1"
}
layer {
  name: "res_stage_2_5_2"
  type: "Convolution"
  bottom: "res_stage_2_5_1"
  top: "res_stage_2_5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_5_2"
  type: "BatchNorm"
  bottom: "res_stage_2_5_2"
  top: "res_stage_2_5_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_5_2"  
  type: "Scale"
  bottom: "res_stage_2_5_2"
  top: "res_stage_2_5_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_2_5"
  type: "Eltwise"
  bottom: "res_2_4"
  bottom: "res_stage_2_5_2"
  top: "res_2_5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_5_relu"
  type: "ReLU"
  bottom: "res_2_5"
  top: "res_2_5"
}
layer {
  name: "res_stage_2_6_1"
  type: "Convolution"
  bottom: "res_2_5"
  top: "res_stage_2_6_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_6_1"
  type: "BatchNorm"
  bottom: "res_stage_2_6_1"
  top: "res_stage_2_6_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_6_1"  
  type: "Scale"
  bottom: "res_stage_2_6_1"
  top: "res_stage_2_6_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_2_6_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_6_1"
  top: "res_stage_2_6_1"
}
layer {
  name: "res_stage_2_6_2"
  type: "Convolution"
  bottom: "res_stage_2_6_1"
  top: "res_stage_2_6_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_6_2"
  type: "BatchNorm"
  bottom: "res_stage_2_6_2"
  top: "res_stage_2_6_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_6_2"  
  type: "Scale"
  bottom: "res_stage_2_6_2"
  top: "res_stage_2_6_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_2_6"
  type: "Eltwise"
  bottom: "res_2_5"
  bottom: "res_stage_2_6_2"
  top: "res_2_6"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_6_relu"
  type: "ReLU"
  bottom: "res_2_6"
  top: "res_2_6"
}
layer {
  name: "res_stage_2_7_1"
  type: "Convolution"
  bottom: "res_2_6"
  top: "res_stage_2_7_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_7_1"
  type: "BatchNorm"
  bottom: "res_stage_2_7_1"
  top: "res_stage_2_7_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_7_1"  
  type: "Scale"
  bottom: "res_stage_2_7_1"
  top: "res_stage_2_7_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_2_7_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_7_1"
  top: "res_stage_2_7_1"
}
layer {
  name: "res_stage_2_7_2"
  type: "Convolution"
  bottom: "res_stage_2_7_1"
  top: "res_stage_2_7_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_7_2"
  type: "BatchNorm"
  bottom: "res_stage_2_7_2"
  top: "res_stage_2_7_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_7_2"  
  type: "Scale"
  bottom: "res_stage_2_7_2"
  top: "res_stage_2_7_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_2_7"
  type: "Eltwise"
  bottom: "res_2_6"
  bottom: "res_stage_2_7_2"
  top: "res_2_7"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_7_relu"
  type: "ReLU"
  bottom: "res_2_7"
  top: "res_2_7"
}
layer {
  name: "res_stage_2_8_1"
  type: "Convolution"
  bottom: "res_2_7"
  top: "res_stage_2_8_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_8_1"
  type: "BatchNorm"
  bottom: "res_stage_2_8_1"
  top: "res_stage_2_8_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_8_1"  
  type: "Scale"
  bottom: "res_stage_2_8_1"
  top: "res_stage_2_8_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_2_8_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_8_1"
  top: "res_stage_2_8_1"
}
layer {
  name: "res_stage_2_8_2"
  type: "Convolution"
  bottom: "res_stage_2_8_1"
  top: "res_stage_2_8_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_8_2"
  type: "BatchNorm"
  bottom: "res_stage_2_8_2"
  top: "res_stage_2_8_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_8_2"  
  type: "Scale"
  bottom: "res_stage_2_8_2"
  top: "res_stage_2_8_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_2_8"
  type: "Eltwise"
  bottom: "res_2_7"
  bottom: "res_stage_2_8_2"
  top: "res_2_8"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_8_relu"
  type: "ReLU"
  bottom: "res_2_8"
  top: "res_2_8"
}
layer {
  name: "res_stage_2_9_1"
  type: "Convolution"
  bottom: "res_2_8"
  top: "res_stage_2_9_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_9_1"
  type: "BatchNorm"
  bottom: "res_stage_2_9_1"
  top: "res_stage_2_9_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_9_1"  
  type: "Scale"
  bottom: "res_stage_2_9_1"
  top: "res_stage_2_9_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_2_9_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_9_1"
  top: "res_stage_2_9_1"
}
layer {
  name: "res_stage_2_9_2"
  type: "Convolution"
  bottom: "res_stage_2_9_1"
  top: "res_stage_2_9_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_9_2"
  type: "BatchNorm"
  bottom: "res_stage_2_9_2"
  top: "res_stage_2_9_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_9_2"  
  type: "Scale"
  bottom: "res_stage_2_9_2"
  top: "res_stage_2_9_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_2_9"
  type: "Eltwise"
  bottom: "res_2_8"
  bottom: "res_stage_2_9_2"
  top: "res_2_9"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_9_relu"
  type: "ReLU"
  bottom: "res_2_9"
  top: "res_2_9"
}
layer {
  name: "res_3_branch1"
  type: "Convolution"
  bottom: "res_2_9"
  top: "res_3_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_3_branch1"
  type: "BatchNorm"
  bottom: "res_3_branch1"
  top: "res_3_branch1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_3_branch1"  
  type: "Scale"
  bottom: "res_3_branch1"
  top: "res_3_branch1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_3_1_1"
  type: "Convolution"
  bottom: "res_2_9"
  top: "res_stage_3_1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_1_1"
  type: "BatchNorm"
  bottom: "res_stage_3_1_1"
  top: "res_stage_3_1_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_1_1"  
  type: "Scale"
  bottom: "res_stage_3_1_1"
  top: "res_stage_3_1_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_3_1_1_relu"
  type: "ReLU"
  bottom: "res_stage_3_1_1"
  top: "res_stage_3_1_1"
}
layer {
  name: "res_stage_3_1_2"
  type: "Convolution"
  bottom: "res_stage_3_1_1"
  top: "res_stage_3_1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_1_2"
  type: "BatchNorm"
  bottom: "res_stage_3_1_2"
  top: "res_stage_3_1_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_1_2"  
  type: "Scale"
  bottom: "res_stage_3_1_2"
  top: "res_stage_3_1_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_3_1"
  type: "Eltwise"
  bottom: "res_3_branch1"
  bottom: "res_stage_3_1_2"
  top: "res_3_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_3_1_relu"
  type: "ReLU"
  bottom: "res_3_1"
  top: "res_3_1"
}
layer {
  name: "res_stage_3_2_1"
  type: "Convolution"
  bottom: "res_3_1"
  top: "res_stage_3_2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_2_1"
  type: "BatchNorm"
  bottom: "res_stage_3_2_1"
  top: "res_stage_3_2_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_2_1"  
  type: "Scale"
  bottom: "res_stage_3_2_1"
  top: "res_stage_3_2_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_3_2_1_relu"
  type: "ReLU"
  bottom: "res_stage_3_2_1"
  top: "res_stage_3_2_1"
}
layer {
  name: "res_stage_3_2_2"
  type: "Convolution"
  bottom: "res_stage_3_2_1"
  top: "res_stage_3_2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_2_2"
  type: "BatchNorm"
  bottom: "res_stage_3_2_2"
  top: "res_stage_3_2_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_2_2"  
  type: "Scale"
  bottom: "res_stage_3_2_2"
  top: "res_stage_3_2_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_3_2"
  type: "Eltwise"
  bottom: "res_3_1"
  bottom: "res_stage_3_2_2"
  top: "res_3_2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_3_2_relu"
  type: "ReLU"
  bottom: "res_3_2"
  top: "res_3_2"
}
layer {
  name: "res_stage_3_3_1"
  type: "Convolution"
  bottom: "res_3_2"
  top: "res_stage_3_3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_3_1"
  type: "BatchNorm"
  bottom: "res_stage_3_3_1"
  top: "res_stage_3_3_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_3_1"  
  type: "Scale"
  bottom: "res_stage_3_3_1"
  top: "res_stage_3_3_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_3_3_1_relu"
  type: "ReLU"
  bottom: "res_stage_3_3_1"
  top: "res_stage_3_3_1"
}
layer {
  name: "res_stage_3_3_2"
  type: "Convolution"
  bottom: "res_stage_3_3_1"
  top: "res_stage_3_3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_3_2"
  type: "BatchNorm"
  bottom: "res_stage_3_3_2"
  top: "res_stage_3_3_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_3_2"  
  type: "Scale"
  bottom: "res_stage_3_3_2"
  top: "res_stage_3_3_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_3_3"
  type: "Eltwise"
  bottom: "res_3_2"
  bottom: "res_stage_3_3_2"
  top: "res_3_3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_3_3_relu"
  type: "ReLU"
  bottom: "res_3_3"
  top: "res_3_3"
}
layer {
  name: "res_stage_3_4_1"
  type: "Convolution"
  bottom: "res_3_3"
  top: "res_stage_3_4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_4_1"
  type: "BatchNorm"
  bottom: "res_stage_3_4_1"
  top: "res_stage_3_4_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_4_1"  
  type: "Scale"
  bottom: "res_stage_3_4_1"
  top: "res_stage_3_4_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_3_4_1_relu"
  type: "ReLU"
  bottom: "res_stage_3_4_1"
  top: "res_stage_3_4_1"
}
layer {
  name: "res_stage_3_4_2"
  type: "Convolution"
  bottom: "res_stage_3_4_1"
  top: "res_stage_3_4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_4_2"
  type: "BatchNorm"
  bottom: "res_stage_3_4_2"
  top: "res_stage_3_4_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_4_2"  
  type: "Scale"
  bottom: "res_stage_3_4_2"
  top: "res_stage_3_4_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_3_4"
  type: "Eltwise"
  bottom: "res_3_3"
  bottom: "res_stage_3_4_2"
  top: "res_3_4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_3_4_relu"
  type: "ReLU"
  bottom: "res_3_4"
  top: "res_3_4"
}
layer {
  name: "res_stage_3_5_1"
  type: "Convolution"
  bottom: "res_3_4"
  top: "res_stage_3_5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_5_1"
  type: "BatchNorm"
  bottom: "res_stage_3_5_1"
  top: "res_stage_3_5_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_5_1"  
  type: "Scale"
  bottom: "res_stage_3_5_1"
  top: "res_stage_3_5_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_3_5_1_relu"
  type: "ReLU"
  bottom: "res_stage_3_5_1"
  top: "res_stage_3_5_1"
}
layer {
  name: "res_stage_3_5_2"
  type: "Convolution"
  bottom: "res_stage_3_5_1"
  top: "res_stage_3_5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_5_2"
  type: "BatchNorm"
  bottom: "res_stage_3_5_2"
  top: "res_stage_3_5_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_5_2"  
  type: "Scale"
  bottom: "res_stage_3_5_2"
  top: "res_stage_3_5_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_3_5"
  type: "Eltwise"
  bottom: "res_3_4"
  bottom: "res_stage_3_5_2"
  top: "res_3_5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_3_5_relu"
  type: "ReLU"
  bottom: "res_3_5"
  top: "res_3_5"
}
layer {
  name: "res_stage_3_6_1"
  type: "Convolution"
  bottom: "res_3_5"
  top: "res_stage_3_6_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_6_1"
  type: "BatchNorm"
  bottom: "res_stage_3_6_1"
  top: "res_stage_3_6_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_6_1"  
  type: "Scale"
  bottom: "res_stage_3_6_1"
  top: "res_stage_3_6_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_3_6_1_relu"
  type: "ReLU"
  bottom: "res_stage_3_6_1"
  top: "res_stage_3_6_1"
}
layer {
  name: "res_stage_3_6_2"
  type: "Convolution"
  bottom: "res_stage_3_6_1"
  top: "res_stage_3_6_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_6_2"
  type: "BatchNorm"
  bottom: "res_stage_3_6_2"
  top: "res_stage_3_6_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_6_2"  
  type: "Scale"
  bottom: "res_stage_3_6_2"
  top: "res_stage_3_6_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_3_6"
  type: "Eltwise"
  bottom: "res_3_5"
  bottom: "res_stage_3_6_2"
  top: "res_3_6"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_3_6_relu"
  type: "ReLU"
  bottom: "res_3_6"
  top: "res_3_6"
}
layer {
  name: "res_stage_3_7_1"
  type: "Convolution"
  bottom: "res_3_6"
  top: "res_stage_3_7_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_7_1"
  type: "BatchNorm"
  bottom: "res_stage_3_7_1"
  top: "res_stage_3_7_1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_7_1"  
  type: "Scale"
  bottom: "res_stage_3_7_1"
  top: "res_stage_3_7_1"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
  name: "res_stage_3_7_1_relu"
  type: "ReLU"
  bottom: "res_stage_3_7_1"
  top: "res_stage_3_7_1"
}
layer {
  name: "res_stage_3_7_2"
  type: "Convolution"
  bottom: "res_stage_3_7_1"
  top: "res_stage_3_7_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
      std: 0.010
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_3_7_2"
  type: "BatchNorm"
  bottom: "res_stage_3_7_2"
  top: "res_stage_3_7_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_3_7_2"  
  type: "Scale"
  bottom: "res_stage_3_7_2"
  top: "res_stage_3_7_2"
  scale_param {
	bias_term: true
  }
  param { 
        lr_mult: 1
  }
}
 layer {
